Repository: portnov/hcheckers
Catalog: python/hcheckers/locale/*/LC_MESSAGES/hcheckers.po
Languages: ru

source: Piece at {} does not have moves
ru: Фишка на {} не имеет ходов

source: Possible target fields: {}
ru: Возможные целевые поля: {}

source: Piece at {} cannot be moved to {}
ru: Фишка на {} не может быть передвинута на {}

source: Field {} does not belong to you
ru: Поле {} не принадлежит вам

source: Another side have offered a draw. You have to accept or decline it.
ru: Соперник предложил ничью. Вам нужно согласиться или отказаться.

source: Other side move: {}
ru: Ход соперника: {}

source: Other side requested undo
ru: Соперник запросил откат

source: Wating for another side turn
ru: Ожидаем хода соперника

source: Another side have offered a draw
ru: Соперник предложил ничью

source: Another side accepted the draw.
ru: Соперник согласился на ничью.

source: Another side declined the draw.
ru: Соперник не согласился на ничью.

source: AI suggested {} move(s)
ru: ИИ предложил {} ходов

source: Russian draughts
ru: Русские шашки

source: https://en.wikipedia.org/wiki/Russian_draughts
ru: https://ru.wikipedia.org/wiki/%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B5_%D1%88%D0%B0%D1%88%D0%BA%D0%B8

source: Simple draughts
ru: Простые шашки

source: English draughts
ru: Английские шашки

source: https://en.wikipedia.org/wiki/English_draughts
ru: https://ru.wikipedia.org/wiki/%D0%90%D0%BD%D0%B3%D0%BB%D0%B8%D0%B9%D1%81%D0%BA%D0%B8%D0%B5_%D1%88%D0%B0%D1%88%D0%BA%D0%B8

source: International draughts
ru: Международные шашки

source: https://en.wikipedia.org/wiki/International_draughts
ru: https://ru.wikipedia.org/wiki/%D0%9C%D0%B5%D0%B6%D0%B4%D1%83%D0%BD%D0%B0%D1%80%D0%BE%D0%B4%D0%BD%D1%8B%D0%B5_%D1%88%D0%B0%D1%88%D0%BA%D0%B8

source: Brazilian draughts
ru: Бразильские шашки

source: https://en.wikipedia.org/wiki/Brazilian_draughts
ru: https://ru.wikipedia.org/wiki/%D0%91%D1%80%D0%B0%D0%B7%D0%B8%D0%BB%D1%8C%D1%81%D0%BA%D0%B8%D0%B5_%D1%88%D0%B0%D1%88%D0%BA%D0%B8

source: Canadian draughts
ru: Канадские шашки

source: https://en.wikipedia.org/wiki/Canadian_checkers
ru: https://ru.wikipedia.org/wiki/%D0%9A%D0%B0%D0%BD%D0%B0%D0%B4%D1%81%D0%BA%D0%B8%D0%B5_%D1%88%D0%B0%D1%88%D0%BA%D0%B8

source: Spancirety draughts
ru: Шашки Спанцирети

source: Diagonal draughts
ru: Диагональные шашки

source: Czech draughts
ru: Чешские шашки

source: https://en.wikipedia.org/wiki/Czech_draughts
ru: https://ru.wikipedia.org/wiki/%D0%A7%D0%B5%D1%88%D1%81%D0%BA%D0%B8%D0%B5_%D1%88%D0%B0%D1%88%D0%BA%D0%B8

source: Turkish draughts
ru: Турецкие шашки

source: https://en.wikipedia.org/wiki/Turkish_draughts
ru: https://ru.wikipedia.org/wiki/%D0%A2%D1%83%D1%80%D0%B5%D1%86%D0%BA%D0%B8%D0%B5_%D1%88%D0%B0%D1%88%D0%BA%D0%B8

source: Armeinan draughts (Tama)
ru: Армянские шашки (Тама)

source: https://en.wikipedia.org/wiki/Armenian_draughts
ru: https://ru.wikipedia.org/wiki/%D0%90%D1%80%D0%BC%D1%8F%D0%BD%D1%81%D0%BA%D0%B8%D0%B5_%D1%88%D0%B0%D1%88%D0%BA%D0%B8

source: Frisian draughts (Alpha)
ru: Фризские шашки (Альфа)

source: https://en.wikipedia.org/wiki/Frisian_draughts
ru: https://ru.wikipedia.org/wiki/%D0%A4%D1%80%D0%B8%D0%B7%D1%81%D0%BA%D0%B8%D0%B5_%D1%88%D0%B0%D1%88%D0%BA%D0%B8

source: Killer draughts
ru: Киллер шашки

source: White
ru: Белые

source: Black
ru: Черные

source: Newly created game ID: {}. First side to move: {}.
ru: ID созданной игры: {}. Первыми ходят: {}.

source: AI settings on server: {}
ru: Настройки ИИ на сервере: {}

source: AI parameters: {}
ru: Параметры ИИ: {}

source: Offer for a draw posted.
ru: Предложение ничьей послано.

source: You accepted draw.
ru: Вы согласились на ничью.

source: You declined draw.
ru: Вы отказались от ничьей.

source: Game #{}: you capitulated.
ru: Игра #{}: вы сдались.

source: Server shutdown requested.
ru: Запрошена остановка сервера.

source: Requested AI to stop thinking
ru: Послан запрос ИИ прекратить обдумывание

source: Initial position
ru: Начальная позиция

source: Toggle history viewing mode
ru: Переключить режим просмотра истории

source: Display initial position
ru: Показать начальную позицию

source: Display next move
ru: Показать следующий ход

source: Display last move
ru: Показать последний ход

source: ID
ru: Ид

source: Status
ru: Статус

source: Rules
ru: Правила

source: Cannot connect to server
ru: Не удалось подключиться к серверу

source: Open file
ru: Открыть файл

source: Browse...
ru: Обзор...

source: Start new game
ru: Начать новую игру

source: Start a game against computer
ru: Начать игру против компьютера

source: Start a game against human
ru: Начать игру против человека

source: Join a game against human
ru: Присоединиться к игре против человека

source: Action
ru: Действие

source: Click to open the description of selected rules
ru: Нажмите, чтобы открыть описание выбранных правил

source: Time control
ru: Контроль времени

source: User name
ru: Имя пользователя

source: User plays
ru: Пользователь играет

source: Use default initial position
ru: Использовать начальную расстановку по умолчанию

source: Manual initial position setup
ru: Ручная начальная расстановка

source: Use initial board of previous game
ru: Использовать начальную расстановку предыдущей игры

source: Load initial board from FEN file
ru: Загрузить начальную расстановку из файла FEN

source: Load initial board from PDN file
ru: Загрузить начальную расстановку из файла PDN

source: Use random initial board preset
ru: Использовать случайную заготовку начальной расстановки

source: Initial board type
ru: Вид начальной расстановки

source: Select file
ru: Выберите файл

source: Start a new game
ru: Начать новую игру

source: Close this dialog without starting a new game
ru: Закрыть этот диалог, не начиная новой игры

source: AI
ru: ИИ

source: Refresh
ru: Обновить

source: Open settings dialog
ru: Открыть диалог настроек

source: E&xit
ru: &Выход

source: Close this dialog and exit the program
ru: Закрыть этот диалог и выйти из программы

source: Settings have been updated.
ru: Настройки были обновлены.

source: Do not use
ru: Не использовать

source: Title
ru: Название

source: Notes
ru: Примечания

source: Default depth (half-steps)
ru: Глубина по умолчанию (в полуходах)

source: Minimum depth
ru: Минимальная глубина

source: Forced mode depth
ru: Глубина форсированного режима

source: Static search mode threshold
ru: Порог режима статического поиска

source: Think better if situation seem bad
ru: Думать глубже, если ситуация кажется плохой

source: Think better if choice is ambigous
ru: Думать глубже, если выбор неоднозначен

source: Maximum depth
ru: Максимальная глубина

source: Think deeper while there is time
ru: Думать глубже, пока есть время

source: Timeout (seconds)
ru: Таймаут (секунд)

source: Think while user is thinking
ru: Думать, пока думает пользователь

source: `Few moves' mode bound
ru: Граница режима 'мало ходов'

source: `Too many moves' mode bound
ru: Граница режима 'слишком много ходов'

source: Use positional score
ru: Использовать оценку позиции

source: Random opening depth
ru: Глубина случайного дебюта

source: Number of first moves to be considered as opening; during these moves, AI will select it's move randomly from several best options
ru: Количество первых ходов, которые должны расцениваться как дебют; в течение этих ходов, ИИ будет выбирать его ход случайным образом из нескольких наилучших

source: Random opening options
ru: Варианты случайного дебюта

source: From how many best options to select during the opening
ru: Из скольки лучших опций выбирать ход в течение дебюта

source: Always accept
ru: Всегда соглашаться

source: Always decline
ru: Всегда отказываться

source: Accept if AI is losing
ru: Соглашаться если ИИ проигрывает

source: Accept draws
ru: Соглашаться на ничьи

source: General
ru: Общее

source: Numerical king weight
ru: Численный вес дамки

source: King positional weight
ru: Позиционный вес дамки

source: Mobility
ru: Мобильность

source: Back row
ru: Первый ряд

source: Center
ru: Центр

source: Border
ru: Край доски

source: Opposite side
ru: Противоположная сторона

source: Backed
ru: Прикрытие

source: Numerical asymetry
ru: Численная асимметрия

source: Positional asymetry
ru: Позиционная асимметрия

source: Pre-king
ru: Почти-дамка

source: Attacked man
ru: Атакованая шашка

source: Attacked king
ru: Атакованая дамка

source: King on key field
ru: Дамка на ключевом поле

source: Man blocked by king
ru: Шашка, блокированная дамкой

source: Board evaluation
ru: Оценка доски

source: Extra options
ru: Дополнительные опции

source: Save...
ru: Сохранить...

source: Save AI settings to JSON file
ru: Сохранить настройки ИИ в файл JSON

source: Load...
ru: Загрузить...

source: Load AI settings from JSON file
ru: Загрузить настройки ИИ из файла JSON

source: Save file
ru: Сохранить файл

source: Load file
ru: Загрузить файл

source: Add AI preset
ru: Добавить настройку ИИ

source: Duplicate AI preset
ru: Дублировать настройку ИИ

source: Delete AI preset
ru: Удалить настройку ИИ

source: Copy of {}
ru: Копия {}

source: Show fields notation on the board
ru: Показывать нотацию полей на доске

source: Show board borders with notation
ru: Показывать края доски с нотацией

source: Show possible moves
ru: Показывать возможные ходы

source: Higlight when another piece is clicked
ru: Подсвечивать при щелчке по другой шашке

source: Always highlight
ru: Всегда подсвечивать

source: Never highlight
ru: Никогда не подсвечивать

source: Highlight possible captures
ru: Подсвечивать возможные взятия

source: Theme
ru: Тема

source: Enable sounds
ru: Включить звуки

source: Remaining time
ru: Оставшееся время

source: Passed time
ru: Прошедшее время

source: In game clock show
ru: В игровых часах показывать

source: Server URL
ru: URL сервера

source: Use local server
ru: Использовать локальный сервер

source: Local server start command
ru: Команда запуска локального сервера

source: Use system settings
ru: Использовать системные настройки

source: Do not use proxy
ru: Не использовать прокси

source: Manual configuration
ru: Ручная настройка

source: Proxy usage
ru: Использование прокси

source: Proxy
ru: Прокси

source: Debug
ru: Отладка

source: Information
ru: Информация

source: Warning
ru: Предупреждения

source: Error
ru: Ошибки

source: Logging level
ru: Уровень журналирования

source: Request confirmation when closing a game
ru: Запрашивать подтверждение при закрытии игры

source: View Settings
ru: Настройки внешнего вида

source: AI Presets
ru: Настройки ИИ

source: HCheckers settings
ru: Настройки HCheckers

source: {}: {} remaining, {} passed {}: {} remaining, {} passed
ru: {}: {} осталось, {} прошло {}: {} осталось, {} прошло

source: {}: {} men, {} kings {}: {} men, {} kings
ru: {}: {} шашек, {} дамок {}: {} шашек, {} дамок

source: HCheckers client
ru: Клиент HCheckers

source: Starting HCheckers...
ru: Запуск HCheckers...

source: This action will discard the current game. Do you wish to continue?
ru: Это действие приведёт к потере текущей игры. Вы хотите продолжить?

source: Your turn.
ru: Ваш ход.

source: Awaiting a turn from another side.
ru: Ожидаем хода соперника.

source: Server appears to be already running, do not start a local server
ru: Похоже, сервер уже запущен; не запускаю локальный сервер

source: Starting local server...
ru: Запуск локального сервера...

source: Running local server: {}
ru: Запускается локальный сервер: {}

source: Could not start local server; exit code: {}; message: {}
ru: Не могу запустить локальный сервер; код выхода: {} {}

source: Exception
ru: Исключение

source: History
ru: История

source: Log
ru: Журнал

source: &Game
ru: &Игра

source: &New Game
ru: &Новая игра

source: &Open Game...
ru: &Открыть игру...

source: &Save Position
ru: &Сохранить позицию

source: Save &Chart as image...
ru: Сохранить &диаграмму как изображение...

source: &Undo
ru: &Отменить

source: Ask AI to stop thinking
ru: Попросить ИИ прекратить обдумывание

source: Ask for AI advice
ru: Попросить совета ИИ

source: Offer a &draw
ru: &Предложить ничью

source: Capitulate
ru: Сдаться

source: &Clear log
ru: О&чистить журнал

source: Copy selected log record
ru: Копировать выбранную запись журнала

source: Save &log...
ru: Сохранить &журнал...

source: Start &Game
ru: Начать &игру

source: Se&ttings
ru: Нас&тройки

source: &Position
ru: &Позиция

source: Put &white piece
ru: Установить &белую шашку

source: Put &black piece
ru: Установить &черную шашку

source: &Remove piece
ru: &Удалить шашку

source: &View
ru: &Вид

source: &Flip board
ru: &Перевернуть доску

source: H&istory
ru: &История

source: &Help
ru: &Справка

source: &Wiki documentation
ru: Документация &Wiki

source: &About HCheckers
ru: &О HCheckers

source: Starting new game...
ru: Запуск новой игры...

source: Rules: {}
ru: Правила: {}

source: AI: {}
ru: ИИ: {}

source: New game ID: {}
ru: ID новой игры: {}

source: Waiting for another side to join the game.
ru: Ожидаем подключения второй стороны к игре

source: Start new game?
ru: Начать новую игру?

source: Open a game?
ru: Открыть игру?

source: Undo
ru: Отменить

source: Undo (number of previously undone moves: {})
ru: Отменить (количество ранее отмененных ходов: {})

source: Ask for AI advice (number of previously requested advices: {})
ru: Попросить совета ИИ (количество ранее запрошенных советов: {})

source: Nothing to undo.
ru: Нечего отменять.

source: Waiting for an advice from AI
ru: Ожидаем совета от ИИ

source: Offer a draw?
ru: Предложить ничью?

source: Are you sure you want to offer a draw to the other side? This action can not be undone.
ru: Вы уверены, что хотите предложить ничью сопернику? Это действие не может быть отменено.

source: Waiting for a response on draw offer from another side
ru: Ожидаем от соперника ответа на предложение ничьей

source: Capitulate?
ru: Сдаться?

source: Are you sure you want to capitulate? This action can not be undone.
ru: Вы уверены, что хотите сдаться? Это действие не может быть отменено.

source: {} win
ru: {} выиграли

source: Draw
ru: Ничья

source: Game result: {}
ru: Результат игры: {}

source: Game over.
ru: Игра окончена.

source: Accept the draw?
ru: Согласиться на ничью?

source: Another side have offered you a draw. Do you wish to accept it?
ru: Соперник предложил вам ничью. Вы хотите согласиться на неё?

source: Response on a draw offer
ru: Ответ на предложение ничьей

source: AI suggested the following move(s): {}
ru: ИИ предложил следующие ходы: {}

source: Log has been cleared.
ru: Журнал был очищен.

source: About HCheckers
ru: О HCheckers

source: This is HCheckers Client application, version {0}.<br>Server version is {1} ({2}).<br>Please report issues at <a href="{3}">{3}</a>.
ru: Это клиентское приложение HCheckers, версия {0}<br>Версия сервера {1} ({2}).<br>Пожалуйста сообщайте о проблемах на странице <a href="{3}">{3}</a>.

source: Unexpected response received from the server. Request URL: {} Response code: {} Response message: {}
ru: От сервера получен неожиданный ответ. URL запроса: {} Код ответа: {} Сообщение в ответе: {}

source: No such move: {}
ru: Нет такого хода: {}

source: Status of current game is unsuitable for this operation. Game status is {}; required status is {}
ru: Статус текущей игры не подходит для данной операции. Статус игры {}; нужный статус {}

source: Custom AI settings are disabled on server side
ru: Пользовательские настройки ИИ запрещены на стороне сервера

source: An exception occured while connecting to the server. Request URL: {} Exception text: {}
ru: При подключении к серверу произошло исключение. URL запроса: {} Текст исключения: {}

source: Exit HCheckers?
ru: Выйти из HCheckers?
